#include <stdio.h>

int main() {
    int score_int = 90.5;
    printf("กรณีที่ 1 (int): score = %d\n", score_int);

    float score_float = 90.5;
    printf("กรณีที่ 2 (float): score = %.1f\n", score_float);

    return 0;
}
//ใช้ int (จำนวนเต็ม) เพื่อเก็บค่า 90.5 ซึ่งเป็นเลขทศนิยมโปรแกรมจะตัดส่วนทศนิยมทิ้งทำให้ค่าที่เก็บได้คือ 90
//ใช้ float (เลขทศนิยม) สามารถเก็บและแสดงค่า 90.5 ได้อย่างถูกต้อง
//ใช้ int เมื่อต้องการเก็บเลขเต็มและใช้ float เมื่อต้องการเก็บเลขมีทศนิยมเพื่อความถูกต้องของข้อมูล