#include <stdio.h>  

int main(){  // ฟังก์ชันหลักของโปรแกรม เป็นจุดเริ่มต้นของการทำงาน

    char ch   = 'T';        // ประกาศตัวแปรชนิด character (ตัวอักษร) และกำหนดค่าเป็น 'T'
    int num   = 18 ;        // ประกาศตัวแปรชนิดจำนวนเต็ม และกำหนดค่าเป็น 18
    float dot = 99.8 ;      // ประกาศตัวแปรชนิดทศนิยม (float) และกำหนดค่าเป็น 99.8
    char str[]  = "male" ;  // ประกาศอาร์เรย์ของ character (string) และกำหนดค่าเป็น "male"

    printf("nameInitial = %c\n" , ch);   // แสดงตัวอักษรจากตัวแปร ch ด้วย %c
    printf("age = %d\n" , num);          // แสดงตัวเลขจำนวนเต็มจากตัวแปร num ด้วย %d
    printf("weight = %.1f\n" , dot);     // แสดงค่าทศนิยมจากตัวแปร dot โดยแสดงทศนิยม 1 ตำแหน่งด้วย %.1f
    printf("gender = %s\n" , str);       // แสดงข้อความ (string) จากตัวแปร str ด้วย %s
    
    return 0;  // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมสิ้นสุดอย่างถูกต้อง
}
